export const PAGE_SIZE = 6;
export const positions = ["产品经理","项目经理","总经理","前端工程师"];
export const departments = ["信息管理部1","信息管理部2","信息管理部3","信息管理部4"];
export const locals = ["总部","地方"];
export const roleId = ["普通员工","特殊员工","领导"];
export const status = ["正常","异常"];
export const NUM_TO_TEXT = ['一', '二', '三', '四', '五', '六', '七', '八', '九', '十', '十一', '十二', '十四', '十六', '十七', '十八',]

export const permission_page_size = 10;

// department/getDeptList   获取部门字典的接口 后期转换
export const departmentDict = ["信息部..","信息部..","信息部..","信息部..","总办","财务部","运营部","青岛财务部","青岛运营部","信息部","信息部","信息部","信息部"];
// POST /crm/api/v1/position/getPosition   获取部门职位的接口 后期转换
export const positionDict = ["总监0..","总监1..","信息总监","信息经理","产品经理","前端工程师","技术6..","技术7..","技术8..","技术9..","技术10..","信息部","信息部6","信息部6","信息部7","信息部8","信息部9","信息部10"];


export const VISIT_TIME =['AM 08:00','AM 09:00','AM 10:00','AM 11:00','AM 12:00','PM 01:00','PM 02:00','PM 03:00','PM 04:00','PM 05:00','PM 06:00','PM 07:00','PM 08:00']

export const filterItemList = [
  {id: 1, name: "年龄"},{id: 2, name: "预产期"},{id: 3, name: "孕期"},{id: 4, name: "生产医院"},
  {id: 5, name: "第几胎"},{id: 6, name: "客资来源"},{id: 7, name: "关注点"},{id: 8, name: "意向套餐"},
  {id: 9, name: "搜索关键字"},{id: 10, name: "操作者1"},{id: 11, name: "现住址"},{id: 12, name: "籍贯"},
  {id: 13, name: "名族"},{id: 14, name: "购买套餐"},{id: 15, name: "会员身份"},{id: 16, name: "操作者2"},
  {id: 17, name: "宝宝生产日期"}]


export const AREA_CODES = {"852":"香港","853":"澳门","0310":"邯郸市","0311":"石家庄","0312":"保定市","0313":"张家口","0314":"承德市","0315":"唐山市","0316":"廊坊市",
  "0317":"沧州市","0318":"衡水市","0319":"邢台市","0335":"秦皇岛","0570":"衢州市","0571":"杭州市","0572":"湖州市","0573":"嘉兴市","0574":"宁波市",
  "0575":"绍兴市","0576":"台州市","0577":"温州市","0578":"丽水市","0579":"金华市","0580":"舟山市","024":"沈阳市","0410":"铁岭市","0411":"大连市",
  "0412":"鞍山市","0413":"抚顺市","0414":"本溪市","0415":"丹东市","0416":"锦州市","0417":"营口市","0418":"阜新市","0419":"辽阳市","0421":"朝阳市",
  "0427":"盘锦市","0429":"葫芦岛","027":"武汉市","0710":"襄城市","0711":"鄂州市","0712":"孝感市","0713":"黄州市","0714":"黄石市","0715":"咸宁市",
  "0716":"荆沙市","0717":"宜昌市","0718":"恩施市","0719":"十堰市","0722":"随枣市","0724":"荆门市","0728":"江汉市","025":"南京市","0510":"无锡市",
  "0511":"镇江市","0512":"苏州市","0513":"南通市","0514":"扬州市","0515":"盐城市","0516":"徐州市","0517":"淮安市","0518":"连云港","0519":"常州市",
  "0523":"泰州市","0470":"海拉尔","0471":"呼和浩特","0472":"包头市","0473":"乌海市","0474":"集宁市","0475":"通辽市","0476":"赤峰市","0477":"东胜市",
  "0478":"临河市","0479":"锡林浩特","0482":"乌兰浩特","0483":"阿拉善左旗","0790":"新余市","0791":"南昌市","0792":"九江市","0793":"上饶市","0794":"临川市",
  "0795":"宜春市","0796":"吉安市","0797":"赣州市","0798":"景德镇","0799":"萍乡市","0701":"鹰潭市","0350":"忻州市","0351":"太原市","0352":"大同市",
  "0353":"阳泉市","0354":"榆次市","0355":"长治市","0356":"晋城市","0357":"临汾市","0358":"离石市","0359":"运城市","0930":"临夏市","0931":"兰州市",
  "0932":"定西市","0933":"平凉市","0934":"西峰市","0935":"武威市","0936":"张掖市","0937":"酒泉市","0938":"天水市","0941":"甘南州","0943":"白银市",
  "0530":"菏泽市","0531":"济南市","0532":"青岛市","0533":"淄博市","0534":"德州市","0535":"烟台市","0536":"淮坊市","0537":"济宁市","0538":"泰安市",
  "0539":"临沂市","0450":"阿城市","0451":"哈尔滨","0452":"齐齐哈尔","0453":"牡丹江","0454":"佳木斯","0455":"绥化市","0456":"黑河市","0457":"加格达奇",
  "0458":"伊春市","0459":"大庆市","0591":"福州市","0592":"厦门市","0593":"宁德市","0594":"莆田市","0595":"晋江市","0596":"漳州市","0597":"龙岩市",
  "0598":"三明市","0599":"南平市","020":"广州市","0751":"韶关市","0752":"惠州市","0753":"梅州市","0754":"汕头市","0755":"深圳市","0756":"珠海市",
  "0757":"佛山市","0758":"肇庆市","0759":"湛江市","0760":"中山市","0762":"河源市","0763":"清远市","0765":"顺德市","0766":"云浮市","0768":"潮州市",
  "0769":"东莞市","0660":"汕尾市","0661":"潮阳市","0662":"阳江市","0663":"揭西市","028":"成都市","0810":"涪陵市","0811":"重庆市","0812":"攀枝花",
  "0813":"自贡市","0814":"永川市","0816":"绵阳市","0817":"南充市","0818":"达县市","0819":"万县市","0825":"遂宁市","0826":"广安市","0827":"巴中市",
  "0840":"泸州市","0831":"宜宾市","0832":"内江市","0833":"乐山市","0834":"西昌市","0835":"雅安市","0836":"康定市","0837":"马尔康","0838":"德阳市",
  "0839":"广元市","0730":"岳阳市","0731":"长沙市","0732":"湘潭市","0733":"株州市","0734":"衡阳市","0735":"郴州市","0736":"常德市","0737":"益阳市",
  "0738":"娄底市","0739":"邵阳市","0743":"吉首市","0744":"张家界","0745":"怀化市","0746":"永州冷","0370":"商丘市","0371":"郑州市","0372":"安阳市",
  "0373":"新乡市","0374":"许昌市","0375":"平顶山","0376":"信阳市","0377":"南阳市","0378":"开封市","0379":"洛阳市","0391":"焦作市","0392":"鹤壁市",
  "0393":"濮阳市","0394":"周口市","0395":"漯河市","0396":"驻马店","0398":"三门峡","0870":"昭通市","0871":"昆明市","0872":"大理市","0873":"个旧市",
  "0874":"曲靖市","0875":"保山市","0876":"文山市","0877":"玉溪市","0878":"楚雄市","0879":"思茅市","0691":"景洪市","0692":"潞西市","0881":"东川市",
  "0883":"临沧市","0886":"六库市","0887":"中甸市","0888":"丽江市","0550":"滁州市","0551":"合肥市","0552":"蚌埠市","0553":"芜湖市","0554":"淮南市",
  "0555":"马鞍山","0556":"安庆市","0557":"宿州市","0558":"阜阳市","0559":"黄山市","0561":"淮北市","0562":"铜陵市","0563":"宣城市","0564":"六安市",
  "0565":"巢湖市","0566":"贵池市","0951":"银川市","0952":"石嘴山","0953":"吴忠市","0954":"固原市","0431":"长春市","0432":"吉林市","0433":"延吉市",
  "0434":"四平市","0435":"通化市","0436":"白城市","0437":"辽源市","0438":"松原市","0439":"浑江市","0440":"珲春市","0770":"防城港","0771":"南宁市",
  "0772":"柳州市","0773":"桂林市","0774":"梧州市","0775":"玉林市","0776":"百色市","0777":"钦州市","0778":"河池市","0779":"北海市","0851":"贵阳市",
  "0852":"遵义市","0853":"安顺市","0854":"都均市","0855":"凯里市","0856":"铜仁市","0857":"毕节市","0858":"六盘水","0859":"兴义市","029":"西安市",
  "0910":"咸阳市","0911":"延安市","0912":"榆林市","0913":"渭南市","0914":"商洛市","0915":"安康市","0916":"汉中市","0917":"宝鸡市","0919":"铜川市",
  "0971":"西宁市","0972":"海东市","0973":"同仁市","0974":"共和市","0975":"玛沁市","0976":"玉树市","0977":"德令哈","0890":"儋州市","0898":"海口市",
  "0899":"三亚市","0891":"拉萨市","0892":"日喀则","0893":"山南市","010":"北京市","021":"上海市","022":"天津市","023":"重庆市","0991":"乌鲁木齐市",
  "0990":"克拉玛依市","0995":"吐鲁番市","0994":"五家渠市","0909":"博乐市","0996":"库尔勒市","0997":"阿拉尔市","0908":"阿图什市","0998":"图木舒克市",
  "0903":"和田市","0999":"伊宁市","0901":"塔城市","0906":"阿勒泰市","0993":"石河子市"}


